# break keyword
"""
Traversing (ট্রাভার্সিং) : Traversing বলতে কোনো List, Tuple বা অন্য কোনো Collection-এর শুরু থেকে শেষ পর্যন্ত প্রতিটি Element একে একে অ্যাক্সেস বা প্রসেস করাকে বোঝায়।

break এবং print()–এর ক্রম:
break এবং print() যে ক্রমে লেখা হবে, Python সেই ক্রমেই statement কার্যকর করে।

1. print() যদি break-এর আগে থাকে:
* আগে print() চলবে।
* তারপর break কার্যকর হবে।
* তাই শর্ত পূরণ হওয়া মানটিও আগে প্রিন্ট হতে পারে।

2. break যদি print()-এর আগে থাকে:
* আগে শর্ত পরীক্ষা হবে।
* শর্ত সত্য হলে break সঙ্গে সঙ্গে লুপ বন্ধ করে দেবে।
* ফলে print() আর চলবে না এবং সেই মানটি প্রিন্ট হবে না।

"""


# Without print 5
for i in range(1, 10, 1):
    if i == 5:
        break
    print(i)


print("=========================")


a = 1
while a <= 10:
    a = a + 1
    print(a)
    if i == 5:
        break





"""Short Note :

Traversing বলতে কোনো Collection-এর প্রতিটি Element শুরু থেকে শেষ পর্যন্ত একে একে অ্যাক্সেস করাকে বোঝায়।

print() যদি break-এর আগে থাকে, তাহলে আগে মানটি প্রিন্ট হবে, তারপর break লুপ বন্ধ করবে।

break যদি print()-এর আগে থাকে, তাহলে শর্ত সত্য হলে লুপ সঙ্গে সঙ্গে বন্ধ হবে এবং মানটি প্রিন্ট হবে না।
"""
